; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-21)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city3)
	(fuel-level plane1 fl3)
	(at plane2 city17)
	(fuel-level plane2 fl2)
	(at plane3 city18)
	(fuel-level plane3 fl2)
	(at plane4 city8)
	(fuel-level plane4 fl1)
	(at person1 city10)
	(at person2 city19)
	(at person3 city10)
	(at person4 city7)
	(at person5 city15)
	(at person6 city5)
	(at person7 city19)
	(at person8 city3)
	(at person9 city4)
	(at person10 city0)
	(at person11 city18)
	(at person12 city3)
	(at person13 city14)
	(at person14 city11)
	(at person15 city2)
	(at person16 city6)
	(at person17 city7)
	(at person18 city15)
	(at person19 city13)
	(at person20 city6)
	(at person21 city10)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city7)
	(at plane4 city5)
	(at person1 city17)
	(at person2 city2)
	(at person3 city18)
	(at person4 city4)
	(at person5 city3)
	(at person7 city3)
	(at person8 city18)
	(at person9 city1)
	(at person10 city3)
	(at person12 city12)
	(at person14 city10)
	(at person15 city4)
	(at person16 city10)
	(at person17 city8)
	(at person18 city11)
	(at person19 city16)
	(at person20 city17)
	(at person21 city14)
	))

)

; plan
1. (fly plane4 city8 city5 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 1 of 20
2. (zoom plane1 city3 city10 fl3 fl2 fl1)
   deleted: (at plane1 city3) (fuel-level plane1 fl3)
   added: (at plane1 city10) (fuel-level plane1 fl1)
   goals met: 1 of 20
3. (board person3 plane1 city10)
   deleted: (at person3 city10)
   added: (in person3 plane1)
   goals met: 1 of 20
4. (board person21 plane1 city10)
   deleted: (at person21 city10)
   added: (in person21 plane1)
   goals met: 1 of 20
5. (board person1 plane1 city10)
   deleted: (at person1 city10)
   added: (in person1 plane1)
   goals met: 1 of 20
6. (fly plane1 city10 city14 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 1 of 20
7. (refuel plane1 city14 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 1 of 20
8. (debark person21 plane1 city14)
   deleted: (in person21 plane1)
   added: (at person21 city14)
   goals met: 2 of 20
9. (fly plane1 city14 city17 fl1 fl0)
   deleted: (at plane1 city14) (fuel-level plane1 fl1)
   added: (at plane1 city17) (fuel-level plane1 fl0)
   goals met: 2 of 20
10. (refuel plane1 city17 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 2 of 20
11. (debark person1 plane1 city17)
   deleted: (in person1 plane1)
   added: (at person1 city17)
   goals met: 3 of 20
12. (fly plane1 city17 city18 fl1 fl0)
   deleted: (at plane1 city17) (fuel-level plane1 fl1)
   added: (at plane1 city18) (fuel-level plane1 fl0)
   goals met: 3 of 20
13. (refuel plane1 city18 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 20
14. (debark person3 plane1 city18)
   deleted: (in person3 plane1)
   added: (at person3 city18)
   goals met: 4 of 20
15. (fly plane1 city18 city7 fl1 fl0)
   deleted: (at plane1 city18) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 5 of 20
16. (board person4 plane1 city7)
   deleted: (at person4 city7)
   added: (in person4 plane1)
   goals met: 5 of 20
17. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 20
18. (board person17 plane1 city7)
   deleted: (at person17 city7)
   added: (in person17 plane1)
   goals met: 5 of 20
19. (fly plane1 city7 city4 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 4 of 20
20. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 4 of 20
21. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   goals met: 4 of 20
22. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   goals met: 5 of 20
23. (fly plane1 city4 city1 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 5 of 20
24. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 20
25. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   goals met: 6 of 20
26. (fly plane1 city1 city8 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 6 of 20
27. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 20
28. (debark person17 plane1 city8)
   deleted: (in person17 plane1)
   added: (at person17 city8)
   goals met: 7 of 20
29. (fly plane1 city8 city7 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 8 of 20
30. (zoom plane2 city17 city0 fl2 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl2)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 8 of 20
31. (board person10 plane2 city0)
   deleted: (at person10 city0)
   added: (in person10 plane2)
   goals met: 8 of 20
32. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 20
33. (fly plane2 city0 city3 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 8 of 20
34. (board person8 plane2 city3)
   deleted: (at person8 city3)
   added: (in person8 plane2)
   goals met: 8 of 20
35. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 20
36. (board person12 plane2 city3)
   deleted: (at person12 city3)
   added: (in person12 plane2)
   goals met: 8 of 20
37. (debark person10 plane2 city3)
   deleted: (in person10 plane2)
   added: (at person10 city3)
   goals met: 9 of 20
38. (zoom plane3 city18 city11 fl2 fl1 fl0)
   deleted: (at plane3 city18) (fuel-level plane3 fl2)
   added: (at plane3 city11) (fuel-level plane3 fl0)
   goals met: 9 of 20
39. (board person14 plane3 city11)
   deleted: (at person14 city11)
   added: (in person14 plane3)
   goals met: 9 of 20
40. (refuel plane3 city11 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 20
41. (fly plane2 city3 city12 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 9 of 20
42. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 20
43. (debark person12 plane2 city12)
   deleted: (in person12 plane2)
   added: (at person12 city12)
   goals met: 10 of 20
44. (fly plane2 city12 city13 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 10 of 20
45. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 20
46. (board person19 plane2 city13)
   deleted: (at person19 city13)
   added: (in person19 plane2)
   goals met: 10 of 20
47. (fly plane2 city13 city16 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 10 of 20
48. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 20
49. (debark person19 plane2 city16)
   deleted: (in person19 plane2)
   added: (at person19 city16)
   goals met: 11 of 20
50. (fly plane2 city16 city15 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 11 of 20
51. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 20
52. (board person5 plane2 city15)
   deleted: (at person5 city15)
   added: (in person5 plane2)
   goals met: 11 of 20
53. (board person18 plane2 city15)
   deleted: (at person18 city15)
   added: (in person18 plane2)
   goals met: 11 of 20
54. (fly plane2 city15 city11 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 11 of 20
55. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 20
56. (debark person18 plane2 city11)
   deleted: (in person18 plane2)
   added: (at person18 city11)
   goals met: 12 of 20
57. (fly plane2 city11 city18 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 12 of 20
58. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 20
59. (debark person8 plane2 city18)
   deleted: (in person8 plane2)
   added: (at person8 city18)
   goals met: 13 of 20
60. (fly plane2 city18 city19 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city19) (fuel-level plane2 fl0)
   goals met: 13 of 20
61. (refuel plane2 city19 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 20
62. (board person7 plane2 city19)
   deleted: (at person7 city19)
   added: (in person7 plane2)
   goals met: 13 of 20
63. (board person2 plane2 city19)
   deleted: (at person2 city19)
   added: (in person2 plane2)
   goals met: 13 of 20
64. (fly plane2 city19 city3 fl1 fl0)
   deleted: (at plane2 city19) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 13 of 20
65. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 20
66. (fly plane3 city11 city10 fl1 fl0)
   deleted: (at plane3 city11) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 13 of 20
67. (debark person14 plane3 city10)
   deleted: (in person14 plane3)
   added: (at person14 city10)
   goals met: 14 of 20
68. (debark person7 plane2 city3)
   deleted: (in person7 plane2)
   added: (at person7 city3)
   goals met: 15 of 20
69. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   goals met: 16 of 20
70. (fly plane2 city3 city2 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 16 of 20
71. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 16 of 20
72. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   goals met: 17 of 20
73. (board person15 plane2 city2)
   deleted: (at person15 city2)
   added: (in person15 plane2)
   goals met: 17 of 20
74. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 20
75. (fly plane2 city2 city4 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 17 of 20
76. (debark person15 plane2 city4)
   deleted: (in person15 plane2)
   added: (at person15 city4)
   goals met: 18 of 20
77. (fly plane4 city5 city6 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 17 of 20
78. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 17 of 20
79. (board person20 plane4 city6)
   deleted: (at person20 city6)
   added: (in person20 plane4)
   goals met: 17 of 20
80. (board person16 plane4 city6)
   deleted: (at person16 city6)
   added: (in person16 plane4)
   goals met: 17 of 20
81. (fly plane4 city6 city10 fl1 fl0)
   deleted: (at plane4 city6) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 17 of 20
82. (refuel plane4 city10 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 17 of 20
83. (debark person16 plane4 city10)
   deleted: (in person16 plane4)
   added: (at person16 city10)
   goals met: 18 of 20
84. (fly plane4 city10 city17 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city17) (fuel-level plane4 fl0)
   goals met: 18 of 20
85. (refuel plane4 city17 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 18 of 20
86. (debark person20 plane4 city17)
   deleted: (in person20 plane4)
   added: (at person20 city17)
   goals met: 19 of 20
87. (fly plane4 city17 city5 fl1 fl0)
   deleted: (at plane4 city17) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 20 of 20
